[
  {
    "url": "https://www.cics.umass.edu/advising/ms-program-advising/ms-advising-faqs",
    "title": "MS Advising FAQs",
    "html_file": "cics_pages\\www-cics-umass-edu_advising_ms-program-advising_ms-advising-faqs.html",
    "text": "MS Advising FAQs : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Open UMass Global Links Menu Visit Apply Give Search UMass.edu Manning College of Information & Computer Sciences Main navigation Academics Toggle submenu for Academics Programs Undergraduate Programs Master's Programs Doctoral Program Graduate Certificate Programs Academic Support Advising Career Development Academic Policies Courses Scholarships and Fellowships Research Toggle submenu for Research Research Research Areas Research Centers & Labs Undergraduate Research Opportunities Faculty & Researchers Faculty Directory Faculty Achievements Turing Award Engage Research News Distinguished Lecturer Series Rising Stars in Computer Science Lecture Series Community Toggle submenu for Community On-Campus Community, Outreach, and Organizational Learning Student Organizations Massenberg Summer STEM Program Awards Programs Senior Celebration External Alumni Support CICS People Toggle submenu for People Full A-Z Directory Faculty Staff About Toggle submenu for About Overview College Overview Leadership Our New Building News & Events News & Stories Events Calendar Connect Visiting CICS Contact Us Employment Offices & Services Info For Toggle submenu for Info For Current Undergraduate Students Current Graduate Students Faculty and Staff Newly Accepted Undergraduate Students MS Advising FAQs Answers to MS in Computer Science Advising Frequently Asked Questions (FAQs) How many classes should I take each semester? International students on a student visa are required to take 9 credits during every semester until their last when they can enroll in one. Can I take more than 12 credits in a semester? The department does not recommend taking 12 credits. Students need to request permission from the Academic Programs office. What courses are available in the summer or winter session? The Manning College of Computer and Information Sciences has one or two courses available each summer. Keep in mind that you can take courses outside of the department that can count towards your Computer Science MS. If you are an international on-campus MS student and it is your LAST SEMESTER, you CANNOT TAKE ONLY ONLINE courses during any term. Can I take classes outside of Computer Science as part of the MS in CS? Yes, you can take graduate-level classes outside of computer science. Here is a list of the pre-approved non-CS classes . Do 600 level seminar courses in Computer Science help fulfill the needed 600-level course requirement for the MS degree? Seminar courses that are 600 level or higher do fulfill the 600 level requirement for MS students. Do 600 level courses from outside of Computer Science help fulfill the needed 600 level course requirement for the MS degree? Yes! If you take a 600-level class in another department or college at UMass, as long as it is pre-approved or you were granted approval, it will count toward the 600-level classes you need for your MS degree. How many online courses can students take each semester? If you are an international student who is part of the on-campus/residential MS program (you are in the US on a student visa), taking 9 credits, you can only take ONE ONLINE course each semester. If you are an international student in the online MS program, you can take as many online courses as you wish. If you are a domestic student both in the US and outside the US, you can take as many online courses as you wish. If you are an international student, on a student visa, taking 12 credits in one semester, or 4 classes, TWO can be online classes. This is because you are going over, above, and exceeding your required classes per semester, which is 9 credits. If you are an international student who is part of the on-campus/residential MS program (you are in the US on a student visa), and it is your LAST SEMESTER, you CANNOT TAKE ONLY ONLINE nor only independent study style (any course ending in 96 is an independent study) courses. This rule applies to winter and summer courses as wel Are UWW and online classes the same thing? No, not all online classes are UWW classes, and not all UWW classes are online. How do I know if a course is online? If a course is online it will NOT have a classroom listed on Spire. TBA is not a classroom, nor is remote learning. A course needs to have a classroom listed for it to be in-person. Can I audit a course? Yes, you can audit a class. When you audit a class you will be able to sit in on the class, participate, have access to the online materials, but you will NOT EARN CREDIT for the class. The class will be billed at the full tuition rate. Instructions on how to audit a class can be found on the Graduate Student Registration page. Please Note: Once you've enrolled in a course as an audit, you can't change back to a letter grade. Can MS students use the University's grade replacement systems to wipe out an F in a class? Unfortunately, no. That policy is only for undergraduates. You do need to have a 3.0 GPA to graduate with an MS, but keep in mind this is a 3.0 across all of the 30 credits you are using to graduate. The F will always be present on your transcript. How do I drop a class after the Add/Drop period? You can drop a class after the add/drop period, however, doing so will result in having a DR (for dropped) on your transcript. You must complete the Graduate School Late Add/Drop form . INTERNATIONAL STUDENTS IN THE ON-CAMPUS MS PROGRAM- You must be enrolled in 9 credits every semester except for your final semester. Therefore, if you are an international student, you cannot drop a class if that would bring your enrollment down to less than 9 credits. The only exceptions to this are explained on the IPO website- https://www.umass.edu/ipo/iss/exceptionsftenrollment. Read these carefully and consult with IPO if you believe they apply to you. Where can I get career advice? CICS has an office dedicated to supporting graduate students in the job search process! CICS Careers can help every part of the job and internship process. CICS Careers can assist with resume review, interview preparation, negotiating offers, and finding positions. Can international students do a Curricular Practical Training (CPT) during the Fall or Spring semester? It can be difficult to meet the requirements to do a CPT during the semester. The only way to hold CPT during the Fall semester WITHOUT the Field Experience Concentration , is laid out below: (without the Field Experience Concentration international students can only do 20 hours of CPT for a MAX of 20 hours a week during an academic semester) You must be full-time (9 credits), in the US, and in the residential MS program You can only take one course per semester that doesn't require your physical presence You must take at least one course that requires your physical presence at UMass Amherst and independent studies are not considered needed a physical presence In your last semester, you don't have to follow rule #1, but you still have to meet requirements #2 and #3. You cannot delay your graduation. You cannot even APPEAR to delay graduation. You cannot do CPT in your final semester if you have already earned 30 credits/completed the MS requirements before the final semester. So....if you are in your last semester in the Spring and think that you can take 696 remotely and work at Amazon in Seattle, you can't. If you have no courses left to take, you can't do a CPT because of rule #5. You can work from Amherst remotely or at a local company, as long as the work is 20 hours a week or less. All of this is for your benefit to make sure you don't run into serious problems in the future. Can international students do a Curricular Practical Training (CPT), for more than 20 hours a week, during the Fall or Spring semester? Yes, international students who are part of the Field Experience Concentration can carry out CPT for more 20 hours a week or more. If students ARE NOT in the Field Experience Concentration, they max number of weekly CPT hours students can hold are 20 hours or less. 20 hours or more of CPT during the Fall or Spring semester is only allowable if the following criteria have been completed: Student has passed or will pass BOTH the AI and Systems Courses required for the Field Experience Concentration before the CPT starts, Student will have been in the US, on a student visa, for at least one whole semester before the CPT starts, AND Student has completed the Field Experience Concentration pre-application, before the CPT is approved. How many classes do international students need to take while they are carrying out full-time CPT during an academic semester, as part of the Field Experience Concentration? When an international MS students are carrying out full-time CPT during an academic semester, as part of the field experience concentration, the student is not required to enroll in any courses except the required 1-credit required CPT class. Students are able to take no classes, one class, or two classes while carrying out full-time CPT. These courses do not need to be in-person, nor do they have to be within computer science. Are international students who are carrying out full-time CPT during the academic semester considered full-time students? Yes, international MS students are carrying out full-time CPT during an academic semester, as part of the field experience concentration, are considered full-time students even if the student is enrolled in only the required 1-credit required CPT class. When can I do a Curricular Practical Training (CPT)? CPT is available to MS students enrolled in the residential MS program after completion of one full-time semester in the US via the Field Experience Concentration . If students ARE NOT a part of the Field Experience Concentration, CPT is available after two full-time semesters in the US. Where do I find directions on how to apply for CPT? You can find those directions on the CPT Process for Internships page. Can I have two concentrations? No, you cannot have two concentrations with your MS degree. How do I start doing research? How do I find a faculty member to work with? Every professor is different. Start by identifying an area that you want to do research in, then see if you can find faculty members or Ph.D. students to speak with. Some will offer independent studies to MS students, some don't. Some have zero MS students they work with, some have 20. Some will want to see you get an A in their course before doing research with them, some do not require you to take their course. It is truly an individual experience, but generally, you will have to take the initiative to find research opportunities. You also may be able to work with Ph.D. students in their labs, too! Does the Master's Project, COMPSCI 701, count as an independent study? No, COMPSCI 701 is not counted as an independent study. It is seen as a 600-level or higher course. Can I do 701 by taking 6 credits in one semester, taking an incomplete and then finishing the incomplete in my last semester? You should take 701Y (Y for year-long) which carries three credits in each of two semesters. You will receive a \"Y\" for the first 3 credits, and then you will receive a letter grade after all 6 credits are complete. This does not affect your credit requirements for Visas. I am very much enjoying research and want to get into the Ph.D. program. How do I do that? Admissions for the Ph.D. are separate so you will have to apply to that program. Keep in mind that the CICS Ph.D. program is even more competitive than the MS program. The thing that will really put your application over the top is to have a CICS faculty member say that you should be admitted to the Ph.D. program because they want to work with you. Approximately, 2-3 MS students are accepted into the Ph.D. program every year. Do independent studies count as 600-level classes? No, unfortunately, they do not count as 600-level classes. They count as independent studies, which are in their own unique category. Does CS 696DS count as an independent study? Yes, all courses that end in X69 are independent studies, including CS 696DS. Can I take an independent study as my only class in my final semester? If you are an international student on a studentv visa, in your final semester, you cannot take an independent study, including, CS 696DS as your only class. You will need to enroll in another class, even just a 1 credit class, inside our outside of CS, that meets in person, on the UMass campus. Students not on a student visa, can take an only an independent study in their final semester. How many credits can MS students take of Independent Studies? MS in CS students are limited to 6 credits of SAT and or independent studies. With this in mind, a student who takes no classes with SAT grades can take 6 credits of independent studies. A student who takes one independent study, can take one class with an SAT grade. What is an SAT grade? How do I request SAT grading for a course? The grade of Satisfactory (SAT) may be assigned as an alternative to a letter grade. Students should check with their instructor at the beginning of the semester regarding the instructor's policy about pass/fail grades. The grade of \"SAT\" is equivalent to \"Passing for Graduate Credit\", which requires an underlying letter grade of C or higher. Students do earn credit for classes where an SAT is earned. Unsatisfactory grades are F grades. UNSAT does not appear as the grade, but rather an F does. Students should ask each professor for each course about if the professors offers SAT grading and what the deadlines for requesting SAT are. Some professors will set a deadline of the middle of the semester, others will have later or earlier deadlines. SAT grades must be requested during the semester, not after. SAT grades are binding. They are not reversible. SAT grades do not fulfill a core requirement. Do SAT grades fulfill the 600-level course requirement or a core requirement? SAT grading is acceptable for a 600-level class. A 600-level class where an SAT is earned will count towards your MS degree and the 600-level requirements. SAT grades are a C grade or higher. Therefore, classes were an SAT is earned cannot count as a core class. Core classes are required to have a B or higher grade. How many SAT grades can be counted toward my MS? MS in CS students are limited to 6 credits of SAT and or independent studies. With this in mind, a student who takes no independent studies can take 6 credits of SAT grading. A student who takes one independent study, can take one class with an SAT grade. Does retaking the a class where an F was earned replace or wipe out the original F grade? Unfortunately, no. MS students who retake a class they failed do not replace the F grade. The F is always on the transcript and it is always factored into the GPA on the transcript. Classes were F's are earned cannot count towards your MS, as no credit is earned. When MS students apply to graduate they list the ten classes they took that complete the MS. The F grade would not be included. MS students can save this graduation application and calculate their MS degree GPA according to the courses on that form. Can MS students do full time CPT in their final semester? Unfortunately, no. MS in CS students cannot do part time CPT in their final semester. This is hard rule and does not change due to a student's concentration. Part time CPT is allowed, 20 hours a week or less. However, students must be enrolled in in-person classes, and CPT must be filed and approved before the end of the add/drop period. Can International MS students in their 1st, 2nd, or 3rd, semesters take an independent study, an online, and an in-person class all at the same time? This is not recommended. All independent studies, except CS 596E and CS 696ds, do not have classrooms on Spire. As per an international MS students' visa rule, MS students need to be in two classes that meet in classrooms. Independent studies do not meet in classrooms. Additionally, by the name independent study, it is seen as not requiring in-person attendance. Students in their 1st, 2nd, or 3rd semester who are doing an independent study for three credits, and want to take an online and in-person course, should consider making their independent study 2-credits, and enrolling in a 1-credit seminar course in CS. This just adds an extra layer of safety by adding an in-person class. It would be preferred if they took two in-person classes and the independent study. Local Navigation Links MS Program Advising MS Advising FAQs Optional Practical Training Site footer Manning College of Information & Computer Sciences Find us on Facebook Find us on YouTube Find us on LinkedIn Find us on Instagram Find us on Flickr Find us on Bluesky Social Address 140 Governors Dr Amherst , MA 01003 United States Visit CICS Give Contact Us Employment Events Calendar Offices & Services Info For Current Undergraduate Students Current Graduate Students Faculty & Staff Newly Accepted Undergraduate Students Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use"
  },
  {
    "url": "https://www.cics.umass.edu/academics/academic-policies/graduate-programs-policies/approved-alternate-courses",
    "title": "Approved UMass Amherst Courses Outside of Computer Science",
    "html_file": "cics_pages\\www-cics-umass-edu_academics_academic-policies_graduate-programs-policies_approved-alternate-courses.html",
    "text": "Approved UMass Amherst Courses Outside of Computer Science : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Open UMass Global Links Menu Visit Apply Give Search UMass.edu Manning College of Information & Computer Sciences Main navigation Academics Toggle submenu for Academics Programs Undergraduate Programs Master's Programs Doctoral Program Graduate Certificate Programs Academic Support Advising Career Development Academic Policies Courses Scholarships and Fellowships Research Toggle submenu for Research Research Research Areas Research Centers & Labs Undergraduate Research Opportunities Faculty & Researchers Faculty Directory Faculty Achievements Turing Award Engage Research News Distinguished Lecturer Series Rising Stars in Computer Science Lecture Series Community Toggle submenu for Community On-Campus Community, Outreach, and Organizational Learning Student Organizations Massenberg Summer STEM Program Awards Programs Senior Celebration External Alumni Support CICS People Toggle submenu for People Full A-Z Directory Faculty Staff About Toggle submenu for About Overview College Overview Leadership Our New Building News & Events News & Stories Events Calendar Connect Visiting CICS Contact Us Employment Offices & Services Info For Toggle submenu for Info For Current Undergraduate Students Current Graduate Students Faculty and Staff Newly Accepted Undergraduate Students Approved UMass Amherst Courses Outside of Computer Science Pre-approved courses count toward the MS, MS/Phd, and PhD requirements, subject to any overall restrictions. The courses below have been pre-approved to count toward the MS , MS/PhD , and PhD requirements, subject to any overall restrictions. Note: Any course not on this pre-approved list not count towards the MS degree. Exceptions may be granted, provided they are requested well before the end of the add/drop period and explicitly approved by the MS program director. Exception requests are reviewed on a case-by-case basis and are not guaranteed to be approved. In order to request an exception, please do the following: Send an email to the MS program director at mpd [at] cs [dot] umass [dot] edu (mpd[at]cs[dot]umass[dot]edu) and cc: Eileen Hamel, Associate Director of Graduate Programs ( hamel [at] umass [dot] edu (hamel[at]umass[dot]edu) ) The subject line of the email should read \"Outside Course Approval for...\" The email should include a pdf of a detailed syllabus and weekly schedule of the course as well as a description of the number and nature (e.g., programming or otherwise) of assignments and projects obtained from the instructor. Biostatistics BIOSTAT 683: Intro to Causal Inference in a Big Data World BIOSTAT 690JQ: Biostatistics Methods 3: Modern Applied BIOSTAT 690NR: Biostatistics Methods 2: Applied Linear BIOSTAT 690T: Applied Statistical Genetics BIOSTAT 730: Applied Bayesian Statistical Modeling BIOSTAT 740: Analysis of Mixed Models Data BIOSTAT 748: Applied Survival Analysis BIOSTAT 749: Statistical Methods in Clinical Trials BIOSTAT 750: Applied Statistical Learning BIOSTAT 790A: Advanced Statistical Inference Civil & Environmental Engineering CEE 790STA- Advanced Probabilistic Machine Learning *** CEE 590STA- Machine Learning Foundations and Applications ***This class may not be used toward the MS degree if COMPSCI 688 and COMPSCI 689 are also being counted toward the MS degree. It may be used if only one of the aforementioned courses is used. DACSS DACSS 601: Data Science Fundamentals DACSS 602: Research Design DACSS 603: Introduction to Quantitative Analysis DACSS 625: Intro to Geo Information System for Planning DACSS 695SL: Social Life of Algorithms DACSS 756- Machine Learning for Social Sciences DACSS 758- Text as Data Courses not approved: DACSS 611: Intro to Python for Data Science; DACSS 690Q: Qualitative Methods for Computational Social Scientists; DACSS 695C - Seminar Corporate Lobbying and the Global Economy; DACSS 690M - Math for Applied Data Science; DACSS 690A - Data Engineering Economics ECON 701: Microeconomic Theory Electrical and Computer Engineering ECE 547: Security Engineering ECE 550: Intro to Quantum Computing (cannot apply to degree w/650) ECE 556: Introduction to Cryptography ECE 565: Digital Signal Processing ECE 568: Computer Architecture ECE 579: Math Tools for Data Science and Machine Learning ECE 590C- Quantum Computing for Communication Networks ECE 597LS: Hardware Design for Machine Learning Systems ECE 603: Probability and Random Processes ECE 606: Electromagnetic Field Theory ECE 608: Signal Theory ECE 610: Foundations in Computer Engineering ECE 634: Optimal Control of Dynamic Systems ECE 647: Security Engineering ECE 650: Intro to Quantum Computing (cannot apply to degree w/550) ECE 651: Introduction to Biosensors and Bioelectronics ECE 656: Introduction to Cryptography ECE 671: Computer Networks ECE 674: Green Computing ECE 676: Neuromorph Engineering ECE 690STC: Foundations of Generative Models ECE 697A: Advanced Computer Networks and Wireless Systems ECE 697CS: Introduction to Compressive Sensing ECE 623: Design Principles for Low-Power Embedded Computer Systems ECE 697LS: Hardware Design for Machine Learning ECE 697SN: Online Social Networks ECE 735: Stochastic Control Dynamic Systems ECE 745: Advanced Communication Theory ECE 746: Statistical Signal Processing Linguistics LINGUIST 509: Introduction to Computational Linguistics LINGUIST 510: Introduction to Semantics LINGUIST 601: Introduction to Transformational Grammer LINGUIST 603- Generative Phonology LINGUIST 606- Phonological Theory LINGUIST 610: Semantics and Generative Grammar LINGUIST 692B: Formal Foundations of Linguistic Theory LINGUIST 692C: Cognitive Modeling Mathematics and Statistics MATH 513: Combinatorics* MATH 532: Topics in Ordinary Differential Equations MATH 535: Statistical Computing MATH 537: Introduction to Mathematics of Finance MATH 545: Linear Algebra for Applied Mathematics MATH 551: Scientific Computing MATH 557: Linear Optimization and Polytopes MATH 571: Introduction to Mathematical Cryptography MATH 590STA: Introduction to Mathematical Machine Learning MATH 548/597U: Introduction to Stochastic Processes and Applications MATH 605: Probability Theory I MATH 611: Algebra I MATH 612: Algebra II MATH 623: Analysis I MATH 624: Analysis II MATH 651: Numerical Analysis I MATH 652: Numerical Analysis II Math 655: Biomed and Health Data Analysis MATH 671: Intro to General Topology I MATH 690STF: Mathematics of Generative Modeling MATH 697CM: ST-Combinatorial Optimization MATH 697PA: ST–Math Foundations/Probabilistic AI MATH 697FA: ST–Math Foundations/Probabilistic AI 2 MATH 697U: Stochastic Processes and Applications MATH 706: Stochastic Calculus MATH 717: Representation Theory MATH790STE: Topological Data Analysis STAT 501: Methods of Applied Statistics STAT 511: Multivariate Statistical Methods STAT 525: Regressions and Analysis of Variance STAT 526: Design of Experiments STAT 535: Statistical Computing STAT 597BD/Math 655: Biomed and Health Data Analysis STAT 607: Mathematical Statistics I STAT 608: Mathematical Statistics II STAT 610: Bayesian Statistics STAT 625: Regression Modeling STAT 630: Introduction to Statistical Learning/Statistical Methods for Data Science STAT 690A: Accelerated Bayesian Statistics STAT 690STA: Applied Semiparametric Regression STAT 697ML: Statistical Machine Learning STAT 697TS: Time Series Analysis and Applications STAT 697U Stochastic Processes and Applications STAT 708: Applied Stochastic Models and Methods Courses not approved: STAT 506, 515, and 516 *Match 513 is cross-listed with COMPSCI 575 Mechanical and Industrial Engineering MIE 532: Network Optimization MIE 620: Linear Programming MIE624: Machine Learning for Dynamic Decision Making MIE 670: Technical Project Management MIE 684: Stochastic Processes in Industrial Engineering I MIE 685: Biorobotics MIE 697U: Strategy-Driven Engineering Innovation MIE 724: Nonlinear and Dynamic Programming Courses not approved: MIE 671 Product Management; MIE 664 Engineering Leadership and Entrepreneurship; MIE 646 Fundamentals of Systems Engineering Physics Physics 564: Advanced Quantum Mechanics Physics 601: Classical Mechanics Physics 605: Methods Math Physics Physics 614: Quantum Mechanics I Physics 615: Quantum Mechanics II Psychology Psychology 615: Cognitive Psychology School of Management SCH-MGMT 597: FA–Foundations of Accounting SCH-MGMT 602: Business Intelligence and Analytics SCH-MGMT 644: Economic Analysis for Manager SCH-MGMT 650: Statistics for Business SCH-MGMT 680: Leadership and Organizational Behavior SCH-MGMT 697DM: Web Analytics for Digital Marketing SCH-MGMT 697RT: Artificial Intelligence for Business SCH-MGMT 890D: Data Science and Machine Learning Courses not approved: SCH-MGMT 597FF, 601, 797FF, 797 VL ST, 697CV, 660, 609, 821 & 822 Local Navigation Links Graduate Programs Policies MS Degree Requirements MS/PhD Degree Requirements PhD Degree Requirements Graduate Student Forms Approved Alternate Courses Site footer Manning College of Information & Computer Sciences Find us on Facebook Find us on YouTube Find us on LinkedIn Find us on Instagram Find us on Flickr Find us on Bluesky Social Address 140 Governors Dr Amherst , MA 01003 United States Visit CICS Give Contact Us Employment Events Calendar Offices & Services Info For Current Undergraduate Students Current Graduate Students Faculty & Staff Newly Accepted Undergraduate Students Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use"
  },
  {
    "url": "https://www.cics.umass.edu/academics/courses",
    "title": "Courses",
    "html_file": "cics_pages\\www-cics-umass-edu_academics_courses.html",
    "text": "Courses : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Open UMass Global Links Menu Visit Apply Give Search UMass.edu Manning College of Information & Computer Sciences Main navigation Academics Toggle submenu for Academics Programs Undergraduate Programs Master's Programs Doctoral Program Graduate Certificate Programs Academic Support Advising Career Development Academic Policies Courses Scholarships and Fellowships Research Toggle submenu for Research Research Research Areas Research Centers & Labs Undergraduate Research Opportunities Faculty & Researchers Faculty Directory Faculty Achievements Turing Award Engage Research News Distinguished Lecturer Series Rising Stars in Computer Science Lecture Series Community Toggle submenu for Community On-Campus Community, Outreach, and Organizational Learning Student Organizations Massenberg Summer STEM Program Awards Programs Senior Celebration External Alumni Support CICS People Toggle submenu for People Full A-Z Directory Faculty Staff About Toggle submenu for About Overview College Overview Leadership Our New Building News & Events News & Stories Events Calendar Connect Visiting CICS Contact Us Employment Offices & Services Info For Toggle submenu for Info For Current Undergraduate Students Current Graduate Students Faculty and Staff Newly Accepted Undergraduate Students Courses Course Offering Plan Course Offering Plan Offering Plan Exceptions - Academic Year 2025-26 Spring 2026- Subject to Change Course Schedule Course Descriptions Course Schedule (PDF) Course Descriptions (PDF) Eligibility/Prereq Registration Information (PDF) Spring 2026 - Overrides Process for students who require special permission to enroll in university-scheduled CICS, COMPSCI, and INFO courses. Override Information » Winter 2026 University+ Course Catalog University+ Registration Instructions Winter 2026 - Override Requests for CICS, COMPSCI, and INFO Courses Process for students who require special permission to enroll in courses offered through University+ (formerly University Without Walls). Override Information » Fall 2025 Course Schedule Course Descriptions Course Schedule (PDF) Course Descriptions (PDF) Eligibility/Prereq Registration Information (PDF) Fall 2025 - Overrides Process for students who require special permission to enroll in university-scheduled CICS, COMPSCI, and INFO courses. Override Information » Summer 2025 University+ Course Catalog University+ Registration Instructions Summer 2025 - Override Requests for CICS, COMPSCI, and INFO Courses Process for students who require special permission to enroll in courses offered through University+ (formerly University Without Walls). Override Information » Courses Not Yet on SPIRE The following NEW (or Revised) experimental courses are being reviewed by the Faculty Senate and will not appear on SPIRE until fully approved: Courses will be listed here once submitted to the Faculty Senate. The following courses are in the process of being added and will appear on SPIRE as soon as Course & Classroom Management has the opportunity to add the course: Courses not requiring Faculty Senate approval will be listed here once submitted to Course & Classroom Management. Spring 2025 Course Schedule Course Descriptions Course Schedule (PDF) Course Descriptions (PDF) Eligibility/Prereq Registration Information (PDF) Fall 2024 Course Schedule Course Descriptions Course Schedule (PDF) Course Descriptions (PDF) Eligibility/Prereq Registration Information (PDF) Other Helpful Tools Course Offering Plan New Course Numbers Prerequisite, Catalog Number, Title, and Credit Changes Final Exam Schedule SPIRE Login Registration Information from the Registrar Courses Outside the College Additional computer science-related courses are also offered in the Department of Electrical and Computer Engineering at UMass and at nearby Amherst, Hampshire, Mount Holyoke, and Smith Colleges. The Five College Course Catalog combines course schedule information from these colleges, as well as UMass. Department of Electrical and Computer Engineering , University of Massachusetts Department of Computer Science , Amherst College Areas of Study: Cognitive Science , Computer Science , Hampshire College Department of Computer Science , Mount Holyoke College Department of Computer Science , Smith College Local Navigation Links Academics Academic Policies Courses Registration Updates Academic Year Course Offering Plan Exceptions New Course Numbers Prerequisite, Catalog, and Credit Changes Course Overrides Scholarships and Fellowships Residential Academic Programs CICS Writing Center Majors Week Site footer Manning College of Information & Computer Sciences Find us on Facebook Find us on YouTube Find us on LinkedIn Find us on Instagram Find us on Flickr Find us on Bluesky Social Address 140 Governors Dr Amherst , MA 01003 United States Visit CICS Give Contact Us Employment Events Calendar Offices & Services Info For Current Undergraduate Students Current Graduate Students Faculty & Staff Newly Accepted Undergraduate Students Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use"
  },
  {
    "url": "https://www.cics.umass.edu/research/research-areas?page=0",
    "title": "Research Areas",
    "html_file": "cics_pages\\www-cics-umass-edu_research_research-areas_page-0.html",
    "text": "Research Areas : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Open UMass Global Links Menu Visit Apply Give Search UMass.edu Manning College of Information & Computer Sciences Main navigation Academics Toggle submenu for Academics Programs Undergraduate Programs Master's Programs Doctoral Program Graduate Certificate Programs Academic Support Advising Career Development Academic Policies Courses Scholarships and Fellowships Research Toggle submenu for Research Research Research Areas Research Centers & Labs Undergraduate Research Opportunities Faculty & Researchers Faculty Directory Faculty Achievements Turing Award Engage Research News Distinguished Lecturer Series Rising Stars in Computer Science Lecture Series Community Toggle submenu for Community On-Campus Community, Outreach, and Organizational Learning Student Organizations Massenberg Summer STEM Program Awards Programs Senior Celebration External Alumni Support CICS People Toggle submenu for People Full A-Z Directory Faculty Staff About Toggle submenu for About Overview College Overview Leadership Our New Building News & Events News & Stories Events Calendar Connect Visiting CICS Contact Us Employment Offices & Services Info For Toggle submenu for Info For Current Undergraduate Students Current Graduate Students Faculty and Staff Newly Accepted Undergraduate Students Research Areas Filters Skip filters Filter by keyword Artificial Intelligence AI research is advancing the frontier of computing by enabling machines to solve problems that require high-level–sometimes human–expertise, perform complex tasks autonomously, learn from experience, interact and collaborate seamlessly with people, and cope effectively with uncertainty and missing information. Computational Biology and Bioinformatics Our research attempts to answer important questions in molecular biology, genetics, biologically-inspired computation, and neuroscience, such as how a protein folds, how genes are expressed and regulated, how biological systems are able to process information robustly, and how they learn and adapt to their environments. Data Management At its core, data management seeks to enhance the capabilities of systems that deal with data, and, together with statistics and machine learning, is one of the pillars of the emerging discipline of Data Science. Electronic Teaching Electronic Teaching involves computational systems that communicate and cooperate with learners at many levels, with strong ties to research in cognitive science, education, engineering, and to other computer science researchers in artificial intelligence, networking, machine learning, information retrieval, and multimedia. Health Informatics Health informatics research is an interdisciplinary field that leverages information technology to improve healthcare delivery and outcomes. Human Language Technologies Human Language Technologies refers to systems that understand, represent, analyze, and search archives and streams of written and spoken language. Human-Computer Interactions Human-Computer Interaction (HCI) research focuses on the design, evaluation, and implementation of interactive computing systems for human use. Information Visualization People rely heavily on data to understand, communicate, and make decisions. By tapping into the power of our visual processing system, data visualizations—maps, Machine Learning Machine learning is the study of computational methods for pattern discovery and skill acquisition and includes methods by which both humans and artificial agents can improve their behavior while interacting with their environments. Mobile and Sensor Systems Our research works on the design of novel low-power sensing systems with applications to mobile health, a next-generation Internet that is focused on seamless support for mobility and trustworthiness, and efficient and low-power wireless connectivity. Pagination Current page 1 Page 2 Next page Last page Site footer Manning College of Information & Computer Sciences Find us on Facebook Find us on YouTube Find us on LinkedIn Find us on Instagram Find us on Flickr Find us on Bluesky Social Address 140 Governors Dr Amherst , MA 01003 United States Visit CICS Give Contact Us Employment Events Calendar Offices & Services Info For Current Undergraduate Students Current Graduate Students Faculty & Staff Newly Accepted Undergraduate Students Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use"
  },
  {
    "url": "https://www.cics.umass.edu/about/contact-us",
    "title": "Contact Us",
    "html_file": "cics_pages\\www-cics-umass-edu_about_contact-us.html",
    "text": "Contact Us : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Open UMass Global Links Menu Visit Apply Give Search UMass.edu Manning College of Information & Computer Sciences Main navigation Academics Toggle submenu for Academics Programs Undergraduate Programs Master's Programs Doctoral Program Graduate Certificate Programs Academic Support Advising Career Development Academic Policies Courses Scholarships and Fellowships Research Toggle submenu for Research Research Research Areas Research Centers & Labs Undergraduate Research Opportunities Faculty & Researchers Faculty Directory Faculty Achievements Turing Award Engage Research News Distinguished Lecturer Series Rising Stars in Computer Science Lecture Series Community Toggle submenu for Community On-Campus Community, Outreach, and Organizational Learning Student Organizations Massenberg Summer STEM Program Awards Programs Senior Celebration External Alumni Support CICS People Toggle submenu for People Full A-Z Directory Faculty Staff About Toggle submenu for About Overview College Overview Leadership Our New Building News & Events News & Stories Events Calendar Connect Visiting CICS Contact Us Employment Offices & Services Info For Toggle submenu for Info For Current Undergraduate Students Current Graduate Students Faculty and Staff Newly Accepted Undergraduate Students Contact Us Manning College of Information and Computer Sciences Computer Science Building 140 Governors Drive Amherst, MA 01003-9264 Phone: (413) 545-2744 Dean Keith Marzullo Phone: (413) 545-2572 Email: dean [at] cics [dot] umass [dot] edu (dean[at]cics[dot]umass[dot]edu) CICS Directories Faculty & Staff A-Z Dean's Office Admissions Inquiries Undergraduate Program Admissions futureugrads [at] cics [dot] umass [dot] edu (futureugrads[at]cics[dot]umass[dot]edu) Graduate Program Admissions cicsgradadm [at] umass [dot] edu ​​​​​​​ Frequently Contacted Offices Undergraduate Advising cicsadvising [at] umass [dot] edu (cicsadvising[at]umass[dot]edu) Career Development cicscareers [at] cics [dot] umass [dot] edu (cicscareers[at]cics[dot]umass[dot]edu) Computing Facilities (IT) system [at] cics [dot] umass [dot] edu (system[at]cics[dot]umass[dot]edu) Marketing & Communications cicsmarcom [at] umass [dot] edu (cicsmarcom[at]umass[dot]edu) Dean's Office dean [at] cs [dot] umass [dot] edu (dean[at]cs[dot]umass[dot]edu) Local Navigation Links About Visiting CICS Contact Us College Overview Leadership Offices & Services Employment Site footer Manning College of Information & Computer Sciences Find us on Facebook Find us on YouTube Find us on LinkedIn Find us on Instagram Find us on Flickr Find us on Bluesky Social Address 140 Governors Dr Amherst , MA 01003 United States Visit CICS Give Contact Us Employment Events Calendar Offices & Services Info For Current Undergraduate Students Current Graduate Students Faculty & Staff Newly Accepted Undergraduate Students Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use"
  }
]